In [1]:
import pandas as pd;

In [2]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [3]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [4]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [5]:
df["Name"]

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [6]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [3]:
import pandas as pd

In [8]:
titanic = pd.read_csv("D:\Python\Demo.csv")

In [5]:
titanic

    PassengerId Survived Pclass Name Sex Age SibSp Parch Ticket Fare Cabin Embarked
0    1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/...
1    2,1,1,"Cumings, Mrs. John Bradley (Florence Br...
2    3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,S...
3    4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May ...
4    5,0,3,"Allen, Mr. William Henry",male,35,0,0,3...
..                                                 ...
886  887,0,2,"Montvila, Rev. Juozas",male,27,0,0,21...
887  888,1,1,"Graham, Miss. Margaret Edith",female,...
888  889,0,3,"Johnston, Miss. Catherine Helen ""Car...
889  890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,11...
890  891,0,3,"Dooley, Mr. Patrick",male,32,0,0,3703...

[891 rows x 1 columns]

In [10]:
In [6]: titanic.to_excel("Demo.xlsx", sheet_name="Demo", index=False)

In [11]:
titanic

    PassengerId Survived Pclass Name Sex Age SibSp Parch Ticket Fare Cabin Embarked
0    1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/...
1    2,1,1,"Cumings, Mrs. John Bradley (Florence Br...
2    3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,S...
3    4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May ...
4    5,0,3,"Allen, Mr. William Henry",male,35,0,0,3...
..                                                 ...
886  887,0,2,"Montvila, Rev. Juozas",male,27,0,0,21...
887  888,1,1,"Graham, Miss. Margaret Edith",female,...
888  889,0,3,"Johnston, Miss. Catherine Helen ""Car...
889  890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,11...
890  891,0,3,"Dooley, Mr. Patrick",male,32,0,0,3703...

[891 rows x 1 columns]

In [12]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column                                                                           Non-Null Count  Dtype
---  ------                                                                           --------------  -----
 0   PassengerId Survived Pclass Name Sex Age SibSp Parch Ticket Fare Cabin Embarked  891 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

In [13]:
titanic = pd.read_csv("D:\Python\Football.csv")

In [14]:
titanic

  Football Club       Manager  Captain Nationality GoalKeeper
0   Real Madrid       Carlo A    Kross     Germany      Lunin
1         Barca   Hansi Flick  De Jong  Netherland        Ter
2       Arsenal  Mikel Aretea  Odegard      Norway       Raya
3      Man City         Pep G      KDB     Belgium    Ederson
4    Man United           ETH    Dalot    Portgual      Onana
5     Liverpool         Kloop      VVD  Netherland    Allison

In [1]:
Football = pd.read_csv("D:\Python\Football.csv")

NameError: name 'pd' is not defined

In [2]:
Football

NameError: name 'Football' is not defined

In [3]:
import pandas as pd

In [4]:
Football = pd.read_csv("D:\Python\Football.csv")

In [5]:
Football

  Football Club       Manager  Captain Nationality GoalKeeper
0   Real Madrid       Carlo A    Kross     Germany      Lunin
1         Barca   Hansi Flick  De Jong  Netherland        Ter
2       Arsenal  Mikel Aretea  Odegard      Norway       Raya
3      Man City         Pep G      KDB     Belgium    Ederson
4    Man United           ETH    Dalot    Portgual      Onana
5     Liverpool         Kloop      VVD  Netherland    Allison

In [6]:
Football.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Football Club  6 non-null      object
 1   Manager        6 non-null      object
 2   Captain        6 non-null      object
 3   Nationality    6 non-null      object
 4   GoalKeeper     6 non-null      object
dtypes: object(5)
memory usage: 372.0+ bytes

In [7]:
Football.head()

  Football Club       Manager  Captain Nationality GoalKeeper
0   Real Madrid       Carlo A    Kross     Germany      Lunin
1         Barca   Hansi Flick  De Jong  Netherland        Ter
2       Arsenal  Mikel Aretea  Odegard      Norway       Raya
3      Man City         Pep G      KDB     Belgium    Ederson
4    Man United           ETH    Dalot    Portgual      Onana

In [8]:
Football.tail()

  Football Club       Manager  Captain Nationality GoalKeeper
1         Barca   Hansi Flick  De Jong  Netherland        Ter
2       Arsenal  Mikel Aretea  Odegard      Norway       Raya
3      Man City         Pep G      KDB     Belgium    Ederson
4    Man United           ETH    Dalot    Portgual      Onana
5     Liverpool         Kloop      VVD  Netherland    Allison

In [9]:
Football.dtype()

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [10]:
Football.dtype

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [11]:
Football.dtypes

Football Club    object
Manager          object
Captain          object
Nationality      object
GoalKeeper       object
dtype: object

In [12]:
Football = Football.to_excel("Football.xlsx", sheet_name = "Football" index = False)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (2050034577.py, line 1)

In [13]:
 Football.to_excel("Football.xlsx", sheet_name = "Football" index = False)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1363932418.py, line 1)

In [14]:
Football.to_excel("Football.xlsx", sheet_name = "Football", index = False)

In [15]:
Football

  Football Club       Manager  Captain Nationality GoalKeeper
0   Real Madrid       Carlo A    Kross     Germany      Lunin
1         Barca   Hansi Flick  De Jong  Netherland        Ter
2       Arsenal  Mikel Aretea  Odegard      Norway       Raya
3      Man City         Pep G      KDB     Belgium    Ederson
4    Man United           ETH    Dalot    Portgual      Onana
5     Liverpool         Kloop      VVD  Netherland    Allison

In [16]:
Football.read_excel("Football.xlsx", sheet_name = "Football")

AttributeError: 'DataFrame' object has no attribute 'read_excel'

In [17]:
Football = pd.read_excel("Football.xlsx", sheet_name = "Football")

In [18]:
Football

  Football Club       Manager  Captain Nationality GoalKeeper
0   Real Madrid       Carlo A    Kross     Germany      Lunin
1         Barca   Hansi Flick  De Jong  Netherland        Ter
2       Arsenal  Mikel Aretea  Odegard      Norway       Raya
3      Man City         Pep G      KDB     Belgium    Ederson
4    Man United           ETH    Dalot    Portgual      Onana
5     Liverpool         Kloop      VVD  Netherland    Allison

In [20]:
Manager = Football["Manager"]

In [21]:
Manager

0         Carlo A
1     Hansi Flick
2    Mikel Aretea
3           Pep G
4             ETH
5           Kloop
Name: Manager, dtype: object